OpenNuvoton/M480BSP/Library/USB_Host/src_core/config.c
/**************************************************************************//**
 * @file     config.c
 * @version  V1.10
 * $Revision: 11 $
 * $Date: 14/10/03 1:54p $
 * @brief  This file manages USB configuration descriptor.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "M480.h"

#include "usb.h"

/// @cond HIDDEN_SYMBOLS

#define USB_MAXALTSETTING       128 /* Hard limit */
#define USB_MAXENDPOINTS        30  /* Hard limit */

#define USB_MAXCONFIG           8   /* Arbitrary limit */


#ifdef DEBUG
static inline const char *plural(int n)
{
    return (n == 1 ? "" : "s");
}
#endif


#ifdef DUMP_DESCRIPTOR
static void  dump_config_descriptor(struct usb_config_descriptor *desc)
{
    uint8_t   *bptr = (uint8_t *)desc;
    int       tlen = desc->wTotalLength;
    struct usb_interface_descriptor  *if_desc;
    struct usb_endpoint_descriptor  *ep_desc;

    while (tlen > 0) {
        switch (bptr[1]) {
        case USB_DT_CONFIG:
            printf("\n[Configuration Descriptor]\n");
            printf("----------------------------------------------\n");
            printf("  Length              = %2d\n",  desc->bLength);
            printf("  DescriptorType      = %02x\n", desc->bDescriptorType);
            printf("  wTotalLength        = %2d\n", desc->wTotalLength);
            printf("  bNumInterfaces      = %d\n", desc->bNumInterfaces);
            printf("  bConfigurationValue = %d\n", desc->bConfigurationValue);
            printf("  iConfiguration      = %d\n", desc->iConfiguration);
            printf("  bmAttributes        = 0x%02x\n", desc->bmAttributes);
            printf("  MaxPower            = %d\n", desc->bMaxPower);
            break;

        case USB_DT_INTERFACE:
            if_desc = (struct usb_interface_descriptor *)bptr;
            printf("\n[Interface Descriptor]\n");
            printf("----------------------------------------------\n");
            printf("  Length              = %2d\n",  if_desc->bLength);
            printf("  DescriptorType      = %02x\n", if_desc->bDescriptorType);
            printf("  bInterfaceNumber    = %d\n", if_desc->bInterfaceNumber);
            printf("  bAlternateSetting   = %d\n", if_desc->bAlternateSetting);
            printf("  bNumEndpoints       = %d\n", if_desc->bNumEndpoints);
            printf("  bInterfaceClass     = 0x%02x\n", if_desc->bInterfaceClass);
            printf("  bInterfaceSubClass  = 0x%02x\n", if_desc->bInterfaceSubClass);
            printf("  bInterfaceProtocol  = 0x%02x\n", if_desc->bInterfaceProtocol);
            printf("  iInterface          = %d\n", if_desc->iInterface);
            break;

        case USB_DT_ENDPOINT:
            ep_desc = (struct usb_endpoint_descriptor *)bptr;
            printf("\n[Endoint Descriptor]\n");
            printf("----------------------------------------------\n");
            printf("  Length              = %2d\n",  ep_desc->bLength);
            printf("  DescriptorType      = %02x\n", ep_desc->bDescriptorType);
            printf("  bEndpointAddress    = 0x%02x\n", ep_desc->bEndpointAddress);
            printf("  bmAttributes        = 0x%02x\n", ep_desc->bmAttributes);
            printf("  wMaxPacketSize      = %d\n", ep_desc->wMaxPacketSize);
            printf("  bInterval           = %d\n", ep_desc->bInterval);
            printf("  bRefresh            = %d\n", ep_desc->bRefresh);
            printf("  bSynchAddress       = %d\n", ep_desc->bSynchAddress);
            break;
        }
        if (bptr[0] == 0)
            break;
        tlen -= bptr[0];
        bptr += bptr[0];
    }
}
#endif


static int find_next_descriptor(unsigned char *buffer, int size,
                                int dt1, int dt2, int *num_skipped)
{
    struct usb_descriptor_header *h;
    int n = 0;
    unsigned char *buffer0 = buffer;

    /* Find the next descriptor of type dt1 or dt2 */
    while (size > 0) {
        h = (struct usb_descriptor_header *) buffer;
        if (h->bDescriptorType == dt1 || h->bDescriptorType == dt2)
            break;
        buffer += h->bLength;
        size -= h->bLength;
        ++n;
    }

    /* Store the number of descriptors skipped and return the
     * number of bytes skipped */
    if (num_skipped)
        *num_skipped = n;
    return buffer - buffer0;
}

static void usb_parse_ss_endpoint_companion(struct device *ddev, int cfgno,
        int inum, int asnum, struct usb_host_endpoint *ep,
        unsigned char *buffer, int size)
{
    struct usb_ss_ep_comp_descriptor *desc;
    int max_tx;

    /* The SuperSpeed endpoint companion descriptor is supposed to
     * be the first thing immediately following the endpoint descriptor.
     */
    desc = (struct usb_ss_ep_comp_descriptor *) buffer;
    if (desc->bDescriptorType != USB_DT_SS_ENDPOINT_COMP ||
            size < USB_DT_SS_EP_COMP_SIZE) {
        USB_debug("No SuperSpeed endpoint companion for config %d "
                  " interface %d altsetting %d ep %d: "
                  "using minimum values\n",
                  cfgno, inum, asnum, ep->desc.bEndpointAddress);

        /* Fill in some default values.
         * Leave bmAttributes as zero, which will mean no streams for
         * bulk, and isoc won't support multiple bursts of packets.
         * With bursts of only one packet, and a Mult of 1, the max
         * amount of data moved per endpoint service interval is one
         * packet.
         */
        ep->ss_ep_comp.bLength = USB_DT_SS_EP_COMP_SIZE;
        ep->ss_ep_comp.bDescriptorType = USB_DT_SS_ENDPOINT_COMP;
        if (usb_endpoint_xfer_isoc(&ep->desc) ||
                usb_endpoint_xfer_int(&ep->desc))
            ep->ss_ep_comp.wBytesPerInterval =
                ep->desc.wMaxPacketSize;
        return;
    }

    memcpy(&ep->ss_ep_comp, desc, USB_DT_SS_EP_COMP_SIZE);

    /* Check the various values */
    if (usb_endpoint_xfer_control(&ep->desc) && desc->bMaxBurst != 0) {
        USB_debug("Control endpoint with bMaxBurst = %d in "
                  "config %d interface %d altsetting %d ep %d: "
                  "setting to zero\n", desc->bMaxBurst,
                  cfgno, inum, asnum, ep->desc.bEndpointAddress);
        ep->ss_ep_comp.bMaxBurst = 0;
    } else if (desc->bMaxBurst > 15) {
        USB_debug("Endpoint with bMaxBurst = %d in "
                  "config %d interface %d altsetting %d ep %d: "
                  "setting to 15\n", desc->bMaxBurst,
                  cfgno, inum, asnum, ep->desc.bEndpointAddress);
        ep->ss_ep_comp.bMaxBurst = 15;
    }

    if ((usb_endpoint_xfer_control(&ep->desc) ||
            usb_endpoint_xfer_int(&ep->desc)) &&
            desc->bmAttributes != 0) {
        USB_debug("%s endpoint with bmAttributes = %d in "
                  "config %d interface %d altsetting %d ep %d: "
                  "setting to zero\n",
                  usb_endpoint_xfer_control(&ep->desc) ? "Control" : "Bulk",
                  desc->bmAttributes,
                  cfgno, inum, asnum, ep->desc.bEndpointAddress);
        ep->ss_ep_comp.bmAttributes = 0;
    } else if (usb_endpoint_xfer_bulk(&ep->desc) &&
               desc->bmAttributes > 16) {
        USB_debug("Bulk endpoint with more than 65536 streams in "
                  "config %d interface %d altsetting %d ep %d: "
                  "setting to max\n",
                  cfgno, inum, asnum, ep->desc.bEndpointAddress);
        ep->ss_ep_comp.bmAttributes = 16;
    } else if (usb_endpoint_xfer_isoc(&ep->desc) &&
               desc->bmAttributes > 2) {
        USB_debug("Isoc endpoint has Mult of %d in "
                  "config %d interface %d altsetting %d ep %d: "
                  "setting to 3\n", desc->bmAttributes + 1,
                  cfgno, inum, asnum, ep->desc.bEndpointAddress);
        ep->ss_ep_comp.bmAttributes = 2;
    }

