OpenNuvoton/M480BSP/Library/USB_Host/src_core/config.c
    if (usb_endpoint_xfer_isoc(&ep->desc))
        max_tx = (desc->bMaxBurst + 1) * (desc->bmAttributes + 1) *
                 usb_endpoint_maxp(&ep->desc);
    else if (usb_endpoint_xfer_int(&ep->desc))
        max_tx = usb_endpoint_maxp(&ep->desc) *
                 (desc->bMaxBurst + 1);
    else
        max_tx = 999999;
    if (le16_to_cpu(desc->wBytesPerInterval) > max_tx) {
        USB_debug("%s endpoint with wBytesPerInterval of %d in "
                  "config %d interface %d altsetting %d ep %d: "
                  "setting to %d\n",
                  usb_endpoint_xfer_isoc(&ep->desc) ? "Isoc" : "Int",
                  le16_to_cpu(desc->wBytesPerInterval),
                  cfgno, inum, asnum, ep->desc.bEndpointAddress,
                  max_tx);
        ep->ss_ep_comp.wBytesPerInterval = cpu_to_le16(max_tx);
    }
}

static int usb_parse_endpoint(struct device *ddev, int cfgno, int inum,
                              int asnum, struct usb_host_interface *ifp, int num_ep,
                              unsigned char *buffer, int size)
{
    unsigned char *buffer0 = buffer;
    struct usb_endpoint_descriptor *d;
    struct usb_host_endpoint *endpoint;
    int n, i, j, retval;

    d = (struct usb_endpoint_descriptor *) buffer;
    buffer += d->bLength;
    size -= d->bLength;

    if (d->bLength >= USB_DT_ENDPOINT_AUDIO_SIZE)
        n = USB_DT_ENDPOINT_AUDIO_SIZE;
    else if (d->bLength >= USB_DT_ENDPOINT_SIZE)
        n = USB_DT_ENDPOINT_SIZE;
    else {
        USB_debug("config %d interface %d altsetting %d has an "
                  "invalid endpoint descriptor of length %d, skipping\n",
                  cfgno, inum, asnum, d->bLength);
        goto skip_to_next_endpoint_or_interface_descriptor;
    }

    i = d->bEndpointAddress & ~USB_ENDPOINT_DIR_MASK;
    if (i >= 16 || i == 0) {
        USB_debug("config %d interface %d altsetting %d has an "
                  "invalid endpoint with address 0x%X, skipping\n",
                  cfgno, inum, asnum, d->bEndpointAddress);
        goto skip_to_next_endpoint_or_interface_descriptor;
    }

    /* Only store as many endpoints as we have room for */
    if (ifp->desc.bNumEndpoints >= num_ep)
        goto skip_to_next_endpoint_or_interface_descriptor;

    endpoint = &ifp->endpoint[ifp->desc.bNumEndpoints];
    ++ifp->desc.bNumEndpoints;

    memcpy(&endpoint->desc, d, n);
    INIT_LIST_HEAD(&endpoint->urb_list);

    /* Fix up bInterval values outside the legal range. Use 32 ms if no
     * proper value can be guessed. */
    i = 0;      /* i = min, j = max, n = default */
    j = 255;
    if (usb_endpoint_xfer_int(d)) {
        i = 1;
        switch (to_usb_device_by_dev(ddev)->speed) {
        case USB_SPEED_SUPER:
        case USB_SPEED_HIGH:
            /* Many device manufacturers are using full-speed
             * bInterval values in high-speed interrupt endpoint
             * descriptors. Try to fix those and fall back to a
             * 32 ms default value otherwise. */
            n = fls(d->bInterval*8);
            if (n == 0)
                n = 9;  /* 32 ms = 2^(9-1) uframes */
            j = 16;
            break;
        default:        /* USB_SPEED_FULL or _LOW */
            /* For low-speed, 10 ms is the official minimum.
             * But some "overclocked" devices might want faster
             * polling so we'll allow it. */
            n = 32;
            break;
        }
    } else if (usb_endpoint_xfer_isoc(d)) {
        i = 1;
        j = 16;
        switch (to_usb_device_by_dev(ddev)->speed) {
        case USB_SPEED_HIGH:
            n = 9;      /* 32 ms = 2^(9-1) uframes */
            break;
        default:        /* USB_SPEED_FULL */
            n = 6;      /* 32 ms = 2^(6-1) frames */
            break;
        }
    }
    if (d->bInterval < i || d->bInterval > j) {
        USB_debug("config %d interface %d altsetting %d "
                  "endpoint 0x%X has an invalid bInterval %d, "
                  "changing to %d\n",
                  cfgno, inum, asnum,
                  d->bEndpointAddress, d->bInterval, n);
        endpoint->desc.bInterval = n;
    }

    /* Some buggy low-speed devices have Bulk endpoints, which is
     * explicitly forbidden by the USB spec.  In an attempt to make
     * them usable, we will try treating them as Interrupt endpoints.
     */
    if (to_usb_device_by_dev(ddev)->speed == USB_SPEED_LOW &&
            usb_endpoint_xfer_bulk(d)) {
        USB_debug("config %d interface %d altsetting %d "
                  "endpoint 0x%X is Bulk; changing to Interrupt\n",
                  cfgno, inum, asnum, d->bEndpointAddress);
        endpoint->desc.bmAttributes = USB_ENDPOINT_XFER_INT;
        endpoint->desc.bInterval = 1;
        if (usb_endpoint_maxp(&endpoint->desc) > 8)
            endpoint->desc.wMaxPacketSize = cpu_to_le16(8);
    }

    /*
     * Some buggy high speed devices have bulk endpoints using
     * maxpacket sizes other than 512.  High speed HCDs may not
     * be able to handle that particular bug, so let's warn...
     */
    if (to_usb_device_by_dev(ddev)->speed == USB_SPEED_HIGH
            && usb_endpoint_xfer_bulk(d)) {
        unsigned maxp;

        maxp = usb_endpoint_maxp(&endpoint->desc) & 0x07ff;
        if (maxp != 512)
            USB_debug("config %d interface %d altsetting %d "
                      "bulk endpoint 0x%X has invalid maxpacket %d\n",
                      cfgno, inum, asnum, d->bEndpointAddress,
                      maxp);
    }

    /* Parse a possible SuperSpeed endpoint companion descriptor */
    if (to_usb_device_by_dev(ddev)->speed == USB_SPEED_SUPER)
        usb_parse_ss_endpoint_companion(ddev, cfgno,
                                        inum, asnum, endpoint, buffer, size);

    /* Skip over any Class Specific or Vendor Specific descriptors;
     * find the next endpoint or interface descriptor */
    endpoint->extra = buffer;
    i = find_next_descriptor(buffer, size, USB_DT_ENDPOINT,
                             USB_DT_INTERFACE, &n);
    endpoint->extralen = i;
    retval = buffer - buffer0 + i;
    if (n > 0)
        USB_debug("skipped %d descriptor%s after %s\n",
                  n, plural(n), "endpoint");
    return retval;

skip_to_next_endpoint_or_interface_descriptor:
    i = find_next_descriptor(buffer, size, USB_DT_ENDPOINT,
                             USB_DT_INTERFACE, NULL);
    return buffer - buffer0 + i;
}

