OpenNuvoton/M480BSP/Library/USB_Host/src_core/config.c
void usb_release_interface_cache(struct kref *ref)
{
    struct usb_interface_cache *intfc;
    int j;

    intfc = ref_to_usb_interface_cache_by_ref(ref);

    for (j = 0; j < intfc->num_altsetting; j++) {
        struct usb_host_interface *alt = &intfc->altsetting[j];

        kfree(alt->endpoint);
        kfree(alt->string);
    }
    kfree(intfc);
}

static int usb_parse_interface(struct device *ddev, int cfgno,
                               struct usb_host_config *config, unsigned char *buffer, int size,
                               u8 inums[], u8 nalts[])
{
    unsigned char *buffer0 = buffer;
    struct usb_interface_descriptor *d;
    int inum, asnum;
    struct usb_interface_cache *intfc;
    struct usb_host_interface *alt;
    int i, n;
    int len, retval;
    int num_ep, num_ep_orig;

    d = (struct usb_interface_descriptor *) buffer;
    buffer += d->bLength;
    size -= d->bLength;

    if (d->bLength < USB_DT_INTERFACE_SIZE)
        goto skip_to_next_interface_descriptor;

    /* Which interface entry is this? */
    intfc = NULL;
    inum = d->bInterfaceNumber;
    for (i = 0; i < config->desc.bNumInterfaces; ++i) {
        if (inums[i] == inum) {
            intfc = config->intf_cache[i];
            break;
        }
    }
    if (!intfc || intfc->num_altsetting >= nalts[i])
        goto skip_to_next_interface_descriptor;

    /* Check for duplicate altsetting entries */
    asnum = d->bAlternateSetting;
    for ((i = 0, alt = &intfc->altsetting[0]);
            i < intfc->num_altsetting;
            (++i, ++alt)) {
        if (alt->desc.bAlternateSetting == asnum) {
            USB_debug("Duplicate descriptor for config %d "
                      "interface %d altsetting %d, skipping\n",
                      cfgno, inum, asnum);
            goto skip_to_next_interface_descriptor;
        }
    }

    ++intfc->num_altsetting;
    memcpy(&alt->desc, d, USB_DT_INTERFACE_SIZE);

    /* Skip over any Class Specific or Vendor Specific descriptors;
     * find the first endpoint or interface descriptor */
    alt->extra = buffer;
    i = find_next_descriptor(buffer, size, USB_DT_ENDPOINT,
                             USB_DT_INTERFACE, &n);
    alt->extralen = i;
    if (n > 0)
        USB_debug("skipped %d descriptor%s after %s\n",
                  n, plural(n), "interface");
    buffer += i;
    size -= i;

    /* Allocate space for the right(?) number of endpoints */
    num_ep = num_ep_orig = alt->desc.bNumEndpoints;
    alt->desc.bNumEndpoints = 0;        /* Use as a counter */
    if (num_ep > USB_MAXENDPOINTS) {
        USB_debug("too many endpoints for config %d interface %d "
                  "altsetting %d: %d, using maximum allowed: %d\n",
                  cfgno, inum, asnum, num_ep, USB_MAXENDPOINTS);
        num_ep = USB_MAXENDPOINTS;
    }

    if (num_ep > 0) {
        /* Can't allocate 0 bytes */
        len = sizeof(struct usb_host_endpoint) * num_ep;
        alt->endpoint = kzalloc(len, GFP_KERNEL);
        if (!alt->endpoint)
            return -ENOMEM;
    }

    /* Parse all the endpoint descriptors */
    n = 0;
    while (size > 0) {
        if (((struct usb_descriptor_header *) buffer)->bDescriptorType
                == USB_DT_INTERFACE)
            break;
        retval = usb_parse_endpoint(ddev, cfgno, inum, asnum, alt,
                                    num_ep, buffer, size);
        if (retval < 0)
            return retval;
        ++n;

        buffer += retval;
        size -= retval;
    }

    if (n != num_ep_orig)
        USB_debug("config %d interface %d altsetting %d has %d "
                  "endpoint descriptor%s, different from the interface "
                  "descriptor's value: %d\n",
                  cfgno, inum, asnum, n, plural(n), num_ep_orig);
    return buffer - buffer0;

skip_to_next_interface_descriptor:
    i = find_next_descriptor(buffer, size, USB_DT_INTERFACE,
                             USB_DT_INTERFACE, NULL);
    return buffer - buffer0 + i;
}

static int usb_parse_configuration(struct usb_device *dev, int cfgidx,
                                   struct usb_host_config *config, unsigned char *buffer, int size)
{
    struct device *ddev;
    unsigned char *buffer0 = buffer;
    int cfgno;
    int nintf, nintf_orig;
    int i, j, n;
    struct usb_interface_cache *intfc;
    unsigned char *buffer2;
    int size2;
    struct usb_descriptor_header *header;
    int len, retval;
    u8 inums[USB_MAXINTERFACES], nalts[USB_MAXINTERFACES];
    unsigned iad_num = 0;

    ddev = &dev->dev;

    memcpy(&config->desc, buffer, USB_DT_CONFIG_SIZE);
    if (config->desc.bDescriptorType != USB_DT_CONFIG ||
            config->desc.bLength < USB_DT_CONFIG_SIZE) {
        USB_error("invalid descriptor for config index %d: "
                  "type = 0x%X, length = %d\n", cfgidx,
                  config->desc.bDescriptorType, config->desc.bLength);
        return -EINVAL;
    }
    cfgno = config->desc.bConfigurationValue;

    buffer += config->desc.bLength;
    size -= config->desc.bLength;

    nintf = nintf_orig = config->desc.bNumInterfaces;
    if (nintf > USB_MAXINTERFACES) {
        USB_debug("config %d has too many interfaces: %d, "
                  "using maximum allowed: %d\n",
                  cfgno, nintf, USB_MAXINTERFACES);
        nintf = USB_MAXINTERFACES;
    }

    /* Go through the descriptors, checking their length and counting the
     * number of altsettings for each interface */
    n = 0;
    for ((buffer2 = buffer, size2 = size);
            size2 > 0;
            (buffer2 += header->bLength, size2 -= header->bLength)) {

        if (size2 < sizeof(struct usb_descriptor_header)) {
            USB_debug("config %d descriptor has %d excess "
                      "byte%s, ignoring\n",
                      cfgno, size2, plural(size2));
            break;
        }

        header = (struct usb_descriptor_header *) buffer2;
        if ((header->bLength > size2) || (header->bLength < 2)) {
            USB_debug("config %d has an invalid descriptor "
                      "of length %d, skipping remainder of the config\n",
                      cfgno, header->bLength);
            break;
        }

        if (header->bDescriptorType == USB_DT_INTERFACE) {
            struct usb_interface_descriptor *d;
            int inum;

            d = (struct usb_interface_descriptor *) header;
            if (d->bLength < USB_DT_INTERFACE_SIZE) {
                USB_debug("config %d has an invalid "
                          "interface descriptor of length %d, "
                          "skipping\n", cfgno, d->bLength);
                continue;
            }

            inum = d->bInterfaceNumber;

            //if ((dev->quirks & USB_QUIRK_HONOR_BNUMINTERFACES) &&
            //    n >= nintf_orig) {
            //  USB_debug("config %d has more interface "
            //      "descriptors, than it declares in "
            //      "bNumInterfaces, ignoring interface "
            //      "number: %d\n", cfgno, inum);
            //  continue;
            //}

