OpenNuvoton/M480BSP/Library/USB_Host/src_core/config.c
            if (inum >= nintf_orig)
                USB_debug("config %d has an invalid "
                          "interface number: %d but max is %d\n",
                          cfgno, inum, nintf_orig - 1);

            /* Have we already encountered this interface?
             * Count its altsettings */
            for (i = 0; i < n; ++i) {
                if (inums[i] == inum)
                    break;
            }
            if (i < n) {
                if (nalts[i] < 255)
                    ++nalts[i];
            } else if (n < USB_MAXINTERFACES) {
                inums[n] = inum;
                nalts[n] = 1;
                ++n;
            }

        } else if (header->bDescriptorType ==
                   USB_DT_INTERFACE_ASSOCIATION) {
            if (iad_num == USB_MAXIADS) {
                USB_debug("found more Interface "
                          "Association Descriptors "
                          "than allocated for in "
                          "configuration %d\n", cfgno);
            } else {
                config->intf_assoc[iad_num] =
                    (struct usb_interface_assoc_descriptor
                     *)header;
                iad_num++;
            }

        } else if (header->bDescriptorType == USB_DT_DEVICE ||
                   header->bDescriptorType == USB_DT_CONFIG)
            USB_debug("config %d contains an unexpected "
                      "descriptor of type 0x%X, skipping\n",
                      cfgno, header->bDescriptorType);

    }   /* for ((buffer2 = buffer, size2 = size); ...) */
    size = buffer2 - buffer;
    config->desc.wTotalLength = cpu_to_le16(buffer2 - buffer0);

    if (n != nintf)
        USB_debug("config %d has %d interface%s, different from "
                  "the descriptor's value: %d\n",
                  cfgno, n, plural(n), nintf_orig);
    else if (n == 0)
        USB_debug("config %d has no interfaces?\n", cfgno);
    config->desc.bNumInterfaces = nintf = n;

    /* Check for missing interface numbers */
    for (i = 0; i < nintf; ++i) {
        for (j = 0; j < nintf; ++j) {
            if (inums[j] == i)
                break;
        }
        if (j >= nintf)
            USB_debug("config %d has no interface number "
                      "%d\n", cfgno, i);
    }

    /* Allocate the usb_interface_caches and altsetting arrays */
    for (i = 0; i < nintf; ++i) {
        j = nalts[i];
        if (j > USB_MAXALTSETTING) {
            USB_debug("too many alternate settings for "
                      "config %d interface %d: %d, "
                      "using maximum allowed: %d\n",
                      cfgno, inums[i], j, USB_MAXALTSETTING);
            nalts[i] = j = USB_MAXALTSETTING;
        }

        len = sizeof(*intfc) + sizeof(struct usb_host_interface) * j;
        config->intf_cache[i] = intfc = kzalloc(len, GFP_KERNEL);
        if (!intfc)
            return -ENOMEM;
        //kref_init(&intfc->ref);
    }

    /* FIXME: parse the BOS descriptor */

    /* Skip over any Class Specific or Vendor Specific descriptors;
     * find the first interface descriptor */
    config->extra = buffer;
    i = find_next_descriptor(buffer, size, USB_DT_INTERFACE,
                             USB_DT_INTERFACE, &n);
    config->extralen = i;
    if (n > 0)
        USB_debug("skipped %d descriptor%s after %s\n",
                  n, plural(n), "configuration");
    buffer += i;
    size -= i;

    /* Parse all the interface/altsetting descriptors */
    while (size > 0) {
        retval = usb_parse_interface(ddev, cfgno, config,
                                     buffer, size, inums, nalts);
        if (retval < 0)
            return retval;

        buffer += retval;
        size -= retval;
    }

    /* Check for missing altsettings */
    for (i = 0; i < nintf; ++i) {
        intfc = config->intf_cache[i];
        for (j = 0; j < intfc->num_altsetting; ++j) {
            for (n = 0; n < intfc->num_altsetting; ++n) {
                if (intfc->altsetting[n].desc.
                        bAlternateSetting == j)
                    break;
            }
            if (n >= intfc->num_altsetting)
                USB_debug("config %d interface %d has no "
                          "altsetting %d\n", cfgno, inums[i], j);
        }
    }

    return 0;
}

/* hub-only!! ... and only exported for reset/reinit path.
 * otherwise used internally on disconnect/destroy path
 */
void usb_destroy_configuration(struct usb_device *dev)
{
    int c, i;

    if (!dev->config)
        return;

    if (dev->rawdescriptors) {
        for (i = 0; i < dev->descriptor.bNumConfigurations; i++)
            kfree(dev->rawdescriptors[i]);

        kfree(dev->rawdescriptors);
        dev->rawdescriptors = NULL;
    }

    for (c = 0; c < dev->descriptor.bNumConfigurations; c++) {
        struct usb_host_config *cf = &dev->config[c];

        kfree(cf->string);
        for (i = 0; i < cf->desc.bNumInterfaces; i++) {
            if (cf->interface[i]->dev.p)
                kfree(cf->interface[i]->dev.p);

            if (cf->intf_cache[i])
                // kref_put(&cf->intf_cache[i]->ref, usb_release_interface_cache);
                usb_release_interface_cache(&cf->intf_cache[i]->ref);
        }
    }
    kfree(dev->config);
    dev->config = NULL;
}


/*
 * Get the USB config descriptors, cache and parse'em
 *
 * hub-only!! ... and only in reset path, or usb_new_device()
 * (used by real hubs and virtual root hubs)
 *
 * NOTE: if this is a WUSB device and is not authorized, we skip the
 *       whole thing. A non-authorized USB device has no
 *       configurations.
 */
int usb_get_configuration(struct usb_device *dev)
{
    //struct device *ddev = &dev->dev;
    int ncfg;
    int result = 0;
    unsigned int cfgno, length;
    unsigned char *bigbuffer;
    struct usb_config_descriptor *desc;

    ncfg = dev->descriptor.bNumConfigurations;

    cfgno = 0;
    //if (dev->authorized == 0) /* Not really an error */
    //  goto out_not_authorized;
    result = -ENOMEM;
    if (ncfg > USB_MAXCONFIG) {
        USB_debug("too many configurations: %d, "
                  "using maximum allowed: %d\n", ncfg, USB_MAXCONFIG);
        dev->descriptor.bNumConfigurations = ncfg = USB_MAXCONFIG;
    }

    if (ncfg < 1) {
        USB_error("no configurations\n");
        return -EINVAL;
    }

