OpenNuvoton/M480BSP/Library/USB_Host/src_core/config.c
    length = ncfg * sizeof(struct usb_host_config);
    dev->config = kzalloc(length, GFP_KERNEL);
    if (!dev->config)
        goto err2;

    length = ncfg * sizeof(char *);
    dev->rawdescriptors = kzalloc(length, GFP_KERNEL);
    if (!dev->rawdescriptors)
        goto err2;

    desc = kmalloc(USB_DT_CONFIG_SIZE, GFP_KERNEL);
    if (!desc)
        goto err2;

    result = 0;
    for (; cfgno < ncfg; cfgno++) {
        /* We grab just the first descriptor so we know how long
         * the whole configuration is */
        result = usb_get_descriptor(dev, USB_DT_CONFIG, cfgno,
                                    desc, USB_DT_CONFIG_SIZE);
        if (result < 0) {
            USB_error("unable to read config index %d "
                      "descriptor/%s: %d\n", cfgno, "start", result);
            USB_error("chopping to %d config(s)\n", cfgno);
            dev->descriptor.bNumConfigurations = cfgno;
            break;
        } else if (result < 4) {
            USB_error("config index %d descriptor too short "
                      "(expected %i, got %i)\n", cfgno,
                      USB_DT_CONFIG_SIZE, result);
            result = -EINVAL;
            goto err;
        }
        length = max((int) le16_to_cpu(desc->wTotalLength),
                     USB_DT_CONFIG_SIZE);

        /* Now that we know the length, get the whole thing */
        bigbuffer = kmalloc(length, GFP_KERNEL);
        if (!bigbuffer) {
            result = -ENOMEM;
            goto err;
        }
        result = usb_get_descriptor(dev, USB_DT_CONFIG, cfgno,
                                    bigbuffer, length);
        if (result < 0) {
            USB_error("unable to read config index %d "
                      "descriptor/%s\n", cfgno, "all");
            kfree(bigbuffer);
            goto err;
        }
        if (result < length) {
            USB_debug("config index %d descriptor too short "
                      "(expected %i, got %i)\n", cfgno, length, result);
            length = result;
        }

        dev->rawdescriptors[cfgno] = (char *)bigbuffer;

#ifdef DUMP_DESCRIPTOR
        dump_config_descriptor((struct usb_config_descriptor *)bigbuffer);
#endif

        result = usb_parse_configuration(dev, cfgno,
                                         &dev->config[cfgno], bigbuffer, length);
        if (result < 0) {
            ++cfgno;
            goto err;
        }
    }
    result = 0;

err:
    kfree(desc);
//out_not_authorized:
    dev->descriptor.bNumConfigurations = cfgno;
err2:
    if (result == -ENOMEM)
        USB_error("out of memory\n");
    return result;
}

void usb_release_bos_descriptor(struct usb_device *dev)
{
    if (dev->bos) {
        kfree((void *)dev->bos->desc);
        kfree(dev->bos);
        dev->bos = NULL;
    }
}

/* Get BOS descriptor set */
int usb_get_bos_descriptor(struct usb_device *dev)
{
    //struct device *ddev = &dev->dev;
    struct usb_bos_descriptor *bos;
    struct usb_dev_cap_header *cap;
    unsigned char *buffer;
    int length, total_len, num, i;
    int ret;

    bos = kzalloc(sizeof(struct usb_bos_descriptor), GFP_KERNEL);
    if (!bos)
        return -ENOMEM;

    /* Get BOS descriptor */
    ret = usb_get_descriptor(dev, USB_DT_BOS, 0, (void *)bos, USB_DT_BOS_SIZE);
    if (ret < USB_DT_BOS_SIZE) {
        USB_error("unable to get BOS descriptor\n");
        if (ret >= 0)
            ret = -ENOMSG;
        kfree((void *)bos);
        return ret;
    }

    length = bos->bLength;
    total_len = le16_to_cpu(bos->wTotalLength);
    num = bos->bNumDeviceCaps;
    kfree((void *)bos);
    if (total_len < length)
        return -EINVAL;

    dev->bos = kzalloc(sizeof(struct usb_host_bos), GFP_KERNEL);
    if (!dev->bos)
        return -ENOMEM;

    /* Now let's get the whole BOS descriptor set */
    buffer = kzalloc(total_len, GFP_KERNEL);
    if (!buffer) {
        ret = -ENOMEM;
        goto err;
    }
    dev->bos->desc = (struct usb_bos_descriptor *)buffer;

    ret = usb_get_descriptor(dev, USB_DT_BOS, 0, buffer, total_len);
    if (ret < total_len) {
        USB_error("unable to get BOS descriptor set\n");
        if (ret >= 0)
            ret = -ENOMSG;
        goto err;
    }
    total_len -= length;

    for (i = 0; i < num; i++) {
        buffer += length;
        cap = (struct usb_dev_cap_header *)buffer;
        length = cap->bLength;

        if (total_len < length)
            break;
        total_len -= length;

        if (cap->bDescriptorType != USB_DT_DEVICE_CAPABILITY) {
            USB_debug("descriptor type invalid, skip\n");
            continue;
        }

        switch (cap->bDevCapabilityType) {
        case USB_CAP_TYPE_WIRELESS_USB:
            /* Wireless USB cap descriptor is handled by wusb */
            break;
        case USB_CAP_TYPE_EXT:
            dev->bos->ext_cap =
                (struct usb_ext_cap_descriptor *)buffer;
            break;
        case USB_SS_CAP_TYPE:
            dev->bos->ss_cap =
                (struct usb_ss_cap_descriptor *)buffer;
            break;
        case CONTAINER_ID_TYPE:
            dev->bos->ss_id =
                (struct usb_ss_container_id_descriptor *)buffer;
            break;
        default:
            break;
        }
    }

    return 0;

err:
    usb_release_bos_descriptor(dev);
    return ret;
}

/// @endcond HIDDEN_SYMBOLS

